#+title: Further examples of regressions
#+author: Daniel Ballesteros-Chávez
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.1 (Org mode 9.3.6)
#+PROPERTY: header-args :R+ :exports both
#+PROPERTY: header-args :R+ :session *R*
#+HTML_HEAD: <style type="text/css"> tr:nth-child(odd) {background-color: #e2e2e2;}  tr:first-child {font-weight: bold}  tr:hover {background-color: #d0c6e5;}</style>
#+HTML_HEAD_EXTRA: <style>code {background-color: #ccc}</style>
:results:
#+HTML_HEAD:<style>
#+HTML_HEAD:/* Daniel Ballesteros-Chavez */
#+HTML_HEAD:/* DBCh CSS for blog project */
#+HTML_HEAD:/* color schemes: #333745; #E63462 ; #C7EFCF ; #EEF5DB ; #909396; #262626;*/
#+HTML_HEAD:/* Modified version with responsive TOC
#+HTML_HEAD:
#+HTML_HEAD:/* usage: #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./style01.css"/> */
#+HTML_HEAD:
#+HTML_HEAD:body {
#+HTML_HEAD:	font-size: 18px;
#+HTML_HEAD:	color: #404040;
#+HTML_HEAD:	/* background-color: #333745; */
#+HTML_HEAD:	font-family: Helvetica;
#+HTML_HEAD:	line-height: 1.3;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:#content {
#+HTML_HEAD:	max-width: 50em;
#+HTML_HEAD:	margin-left: auto;
#+HTML_HEAD:	margin-right: auto;
#+HTML_HEAD:    padding: 15px 50px 50px 15px;
#+HTML_HEAD:    background-color: #E4F7FF;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:p {
#+HTML_HEAD:		text-align: justify;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:
#+HTML_HEAD:/* this part is about the table of contents TOC */
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents a:link,
#+HTML_HEAD:#table-of-contents a:visited {
#+HTML_HEAD:    color: #404040;
#+HTML_HEAD:    background: transparent;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents a:hover {
#+HTML_HEAD:  background-color: #ccc;
#+HTML_HEAD:  color: #404040;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents {
#+HTML_HEAD:    line-height: 1.2;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents h2 {
#+HTML_HEAD:    background-color:  #ccc ;
* The explicit calculation of the AIC

The Akaike information criterion (AIC) is an estimator of prediction
error of statistical models for a given data set.

AIC estimates the relative amount of information lost by a given
model: the less information a model loses, the higher the quality of
that model.

Given 2 models with $AIC_1$ and $AIC_2$, define $AIC_{min}$ to be the minimum between
$AIC_1$ and $AIC_2$. Then the quantity:
\begin{equation}
\exp\left( \frac{AIC_{min} - AIC_{j}}{2}\right),
\end{equation}

can be interpreted as being proportional to the probability that the
 model "j" minimizes the (estimated) information loss.

#+begin_src R :exports both
df <- data.frame(
"Year" = c(
2000, 2001, 2002, 2003, 2004, 2005,
2006, 2007, 2008, 2009, 2010, 2011,
2012, 2013, 2014, 2015, 2016, 2017,
2018, 2019, 2020),
"Expenditure" = c(
125, 127, 118, 119, 135, 146,
155, 175, 202, 238, 270, 303,
372, 375, 420, 470, 467, 536,
668, 789, 845),
"PatentsApp" = c(
2404, 2202, 2313, 2268, 2381, 2028,
2157, 2392, 2488, 2883, 3203, 3880,
4415, 4237, 3939, 4676, 4261, 3942,
4207, 3887, 4010))

myfit  <- lm(PatentsApp ~ Expenditure, data= df)

## note that we can write


mu <- myfit$fitted.values
NN <- length(df$PatentsApp)
rss <- sum((myfit$model$PatentsApp - mu)^2)  ## RSS  residue sums of squares
ss2 <- rss/(NN) ## Here we use the Population variance definition.
ssdd <- sqrt(ss2)

my.log.like <- -NN/2 * log(2*pi) - NN*log(ssdd) - rss/(2*ss2)

p <- 2 ## 

my.aic <- -2*my.log.like + 2*(p+1)

summary(myfit)
print(c( AIC(myfit), my.aic))
#+end_src

#+RESULTS:
| 331.409410702845 |
| 331.409410702845 |




